In [38]:
import numpy as np
import pandas as pd
import math

Explore data set

In [39]:
data_test = pd.read_csv('z_test.csv')

In [40]:
data_test.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,23603,city_160,0.920,Male,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,1,78
1,22499,city_45,0.890,NaN,Has relevent experience,Full time course,High School,NaN,6,50-99,Pvt Ltd,1,36
2,10465,city_149,0.689,Male,No relevent experience,no_enrollment,Graduate,STEM,5,NaN,NaN,never,34
3,8293,city_67,0.855,Female,Has relevent experience,no_enrollment,Masters,STEM,9,1000-4999,Pvt Ltd,1,149
4,4246,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,16,50-99,Funded Startup,2,7

In [41]:
data_test.shape

(3832, 13)

In [42]:
data_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3832 entries, 0 to 3831
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             3832 non-null   int64
 1   city                    3832 non-null   object
 2   city_development_index  3832 non-null   float64
 3   gender                  2925 non-null   object
 4   relevent_experience     3832 non-null   object
 5   enrolled_university     3748 non-null   object
 6   education_level         3741 non-null   object
 7   major_discipline        3256 non-null   object
 8   experience              3817 non-null   object
 9   company_size            2628 non-null   object
 10  company_type            2583 non-null   object
 11  last_new_job            3748 non-null   object
 12  training_hours          3832 non-null   int64
dtypes: float64(1), int64(2), object(10)
memory usage: 389.3+ KB

In [43]:
data_test.describe()

        enrollee_id  city_development_index  training_hours
count   3832.000000             3832.000000     3832.000000
mean   17023.656315                0.824523       65.718163
std     9581.132710                0.126021       59.980867
min       10.000000                0.448000        1.000000
25%     8791.250000                0.698000       23.000000
50%    17043.000000                0.899000       48.000000
75%    25285.750000                0.920000       88.000000
max    33362.000000                0.949000      336.000000

Handle missing values

In [44]:
#data_test.isna().sum()/data_test.shape[0]

data_test.isnull().sum()/data_test.shape[0]

enrollee_id               0.000000
city                      0.000000
city_development_index    0.000000
gender                    0.236691
relevent_experience       0.000000
enrolled_university       0.021921
education_level           0.023747
major_discipline          0.150313
experience                0.003914
company_size              0.314196
company_type              0.325939
last_new_job              0.021921
training_hours            0.000000
dtype: float64

In [45]:
#company_type y company_size tienen más del 30% de nulos, vamos a eliminarlas
data_test.drop(labels=['company_type', 'company_size'], axis=1, inplace=True)
#data_test.dropna(inplace=True)

In [46]:
data_test.isna().sum()/data_test.shape[0]

enrollee_id               0.000000
city                      0.000000
city_development_index    0.000000
gender                    0.236691
relevent_experience       0.000000
enrolled_university       0.021921
education_level           0.023747
major_discipline          0.150313
experience                0.003914
last_new_job              0.021921
training_hours            0.000000
dtype: float64

In [52]:
#replace Missing
data_test.fillna(0, inplace=True)

In [53]:
data_test.shape

(3832, 11)

In [54]:
# export to CSV file
data_test.to_csv('data_test_clean.csv', index=False)